Revit 2027 API
FieldBuilder(FieldBuilder) Constructor
 Constructs a new copy of the input ESFieldBuilder object.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FieldBuilder(
	FieldBuilder other
)
Public Sub New (
	other As FieldBuilder
)
public:
FieldBuilder(
	FieldBuilder^ other
)
new :
        other : FieldBuilder -> FieldBuilder
Parameters
other FieldBuilder
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FieldBuilder Class
FieldBuilder Overload
Autodesk.Revit.DB.ExtensibleStorage Namespace